/**
 * 行程数据配置
 * 修改行程请编辑此文件
 */
const TRIP_DATA = [
  {
    day: "第一天（6月19日）",
    items: [
      {
        id: "day1-1",
        name: "抵达龙嘉机场",
        time: "下午 15:50",
        icon: "✈️",
        location: [125.694354,43.998489]
      },
      {
        id: "day1-2",
        name: "吃元盛居火锅总店",
        time: "下午 17:00",
        icon: "🫕",
        location: [125.376872,43.826336]
      },
      {
        id: "day1-3",
        name: "酒店办理入住",
        time: "下午 19:00",
        icon: "🏨",
        location: [125.380586,43.790402]
      }
    ]
  },
  {
    day: "第二天（6月20日）",
    items: [
      {
        id: "day2-1",
        name: "逛世纪广场早市",
        time: "上午 06:00",
        icon: "️🌆",
        location: [125.405629,43.833456]
      },
      {
        id: "day2-2",
        name: "酒店办理退房",
        time: "中午 11:30",
        icon: "🏨",
        location: [125.380586,43.790402]
      },
      {
        id: "day2-3",
        name: "吃东方饺子王",
        time: "中午 12:00",
        icon: "️🥟",
        location: [125.365941,43.824605]
      },
      {
        id: "day2-4",
        name: "去温泉酒店放行李",
        time: "下午 14:50",
        icon: "🏠",
        location: [125.30323,43.822192]
      },
      {
        id: "day2-5",
        name: "去这有山逛主题商场",
        time: "下午 15:10",
        icon: "🏬",
        location: [125.292631,43.866919]
      },
      {
        id: "day2-6",
        name: "去桂林路吃小吃",
        time: "下午 17:00",
        icon: "🌭",
        location: [125.318128,43.866337]
      },
      {
        id: "day2-7",
        name: "回酒店泡澡",
        time: "下午 19:00",
        icon: "♨️",
        location: [125.30323,43.822192]
      },
    ]
  },
  {
    day: "第三天（6月X日）",
    items: [
      {
        id: "day3-0",
        name: "去公园吹风（如果你能起得来）",
        time: "清晨 04:00",
        icon: "🏞️",
        location: [125.455345,43.801388]
      },
      {
        id: "day3-1",
        name: "酒店退房",
        time: "中午 12:00",
        icon: "🏠",
        location: [125.30323,43.822192]
      },
      {
        id: "day3-2",
        name: "小海德家里",
        time: "下午 12:30",
        icon: "🏠",
        location: [125.358497,43.842107]
      },
      {
        id: "day3-3",
        name: "吃韩式（东北？）烤肉",
        time: "下午 13:30",
        icon: "🥩",
        location: [125.37025,43.845199]
      },
      {
        id: "day3-4",
        name: "去坐摩天轮",
        time: "下午 14:30",
        icon: "🎡",
        location: [125.379262,43.835152]
      },
      {
        id: "day3-4",
        name: "坐火车去机场",
        time: "下午 17:00",
        icon: "🚂",
        location: [125.324329,43.912597]
      },
      {
        id: "day3-5",
        name: "到达机场",
        time: "下午 17:30",
        icon: "✈️",
        location: [125.694951,43.997004]
      }
    ]
  }
];
